CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/app/wisun/component/app_core/sl_wisun_app_core.c
// -----------------------------------------------------------------------------
//                                Static Variables
// -----------------------------------------------------------------------------

/// Create default setting if app settings is not available
#if !defined(SL_CATALOG_WISUN_APP_SETTING_PRESENT)
static const app_setting_wisun_t _app_default_settings = {
#if defined(WISUN_CONFIG_NETWORK_NAME)
  .network_name = WISUN_CONFIG_NETWORK_NAME,
#else
  .network_name = "Wi-SUN Network",
#endif
#if defined(WISUN_CONFIG_NETWORK_SIZE)
  .network_size = WISUN_CONFIG_NETWORK_SIZE,
#else
  .network_size = SL_WISUN_NETWORK_SIZE_SMALL,
#endif
#if defined(WISUN_CONFIG_TX_POWER)
  .tx_power = WISUN_CONFIG_TX_POWER,
#else
  .tx_power = 20U,
#endif
  .is_default_phy = true,
#if defined(WISUN_CONFIG_DEVICE_TYPE)
  .device_type = WISUN_CONFIG_DEVICE_TYPE,
#else
  .device_type = SL_WISUN_ROUTER,
#endif
#if defined(WISUN_CONFIG_DEVICE_PROFILE)
  .lfn_profile = WISUN_CONFIG_DEVICE_PROFILE,
#else
  .lfn_profile = SL_WISUN_LFN_PROFILE_TEST,
#endif
#if defined(WISUN_CONFIG_DEFAULT_PHY_FAN10)
  .phy = {
    .type = SL_WISUN_PHY_CONFIG_FAN10,
    .config.fan10.reg_domain = WISUN_CONFIG_REGULATORY_DOMAIN,
    .config.fan10.op_class = WISUN_CONFIG_OPERATING_CLASS,
    .config.fan10.op_mode = WISUN_CONFIG_OPERATING_MODE,
  },
#elif defined(WISUN_CONFIG_DEFAULT_PHY_FAN11)
  .phy = {
    .type = SL_WISUN_PHY_CONFIG_FAN11,
    .config.fan11.reg_domain = WISUN_CONFIG_REGULATORY_DOMAIN,
    .config.fan11.chan_plan_id = WISUN_CONFIG_CHANNEL_PLAN_ID,
    .config.fan11.phy_mode_id = WISUN_CONFIG_PHY_MODE_ID,
  },
#else
  .phy = { 0 },
#endif
};
#endif

/// Here we track if regional regulation is active or not
static bool _regional_regulation_active = false;

static sl_wisun_app_core_reg_thresholds_t _tresholds = {
  .warning_threshold = SL_WISUN_APP_CORE_DEFAULT_REGULATION_WARNING_THRESHOLD,
  .alert_threshold = SL_WISUN_APP_CORE_DEFAULT_REGULATION_ALERT_THRESHOLD,
};

/// App framework mutex
static osMutexId_t _app_core_mtx = NULL;

///  App framework mutex attribute
static const osMutexAttr_t _app_wisun_mtx_attr = {
  .name      = "AppWisunkMutex",
  .attr_bits = osMutexRecursive,
  .cb_mem    = NULL,
  .cb_size   = 0
};

/// Current address storage
static sl_wisun_app_core_current_addr_t _current_addr = { 0U };

/// error flag for errors
static osEventFlagsId_t _app_core_state = NULL;

/// Sate event flags attributes
static const osEventFlagsAttr_t _app_wisun_evt_attr = {
  .name      = "AppWisunEvtFlags",
  .attr_bits = 0,
  .cb_mem    = NULL,
  .cb_size   = 0
};

/// Internal join state
static sl_wisun_join_state_t _join_state = SL_WISUN_JOIN_STATE_DISCONNECTED;

/// Internal setting storage
static app_setting_wisun_t _setting = { 0U };

/// Time statistic storage
static sl_wisun_app_core_time_stat_t _time_stat = { 0U };

// -----------------------------------------------------------------------------
//                          Public Function Definitions
// -----------------------------------------------------------------------------

/* Network update event handler */
void sl_wisun_network_update_event_hnd(sl_wisun_evt_t *evt)
{
  const char *ip_str = NULL;
  const char *time_str = NULL;
  static sl_wisun_trace_util_time_t time = { 0U };
  uint64_t time_ms = 0ULL;

  sl_sleeptimer_tick64_to_ms(sl_sleeptimer_get_tick_count64(), &time_ms);
  time_ms = time_ms - _time_stat.connected_ms;
  app_wisun_trace_util_timestamp_init(time_ms, &time);
  time_str = app_wisun_trace_util_time_to_str(&time);
  if (time_str == NULL) {
    time_str = "";
  }

  if (evt->evt.network_update.status == SL_STATUS_OK) {
    if (evt->evt.network_update.flags & (1 << SL_WISUN_NETWORK_UPDATE_FLAGS_GLOBAL_IP)) {
      _store_address("GLOBAL", SL_WISUN_IP_ADDRESS_TYPE_GLOBAL, &_current_addr.global);
      ip_str = app_wisun_trace_util_get_ip_str(&_current_addr.global);
      printf("[%s Network update: Global %s]\n", time_str, ip_str);
    }
    if (evt->evt.network_update.flags & (1 << SL_WISUN_NETWORK_UPDATE_FLAGS_PRIMARY_PARENT)) {
      _store_address("PRIM_PARENT", SL_WISUN_IP_ADDRESS_TYPE_PRIMARY_PARENT, &_current_addr.primary_parent);
      ip_str = app_wisun_trace_util_get_ip_str(&_current_addr.primary_parent);
      printf("[%s Network update: Primary Parent %s]\n", time_str, ip_str);
    }
    if (evt->evt.network_update.flags & (1 << SL_WISUN_NETWORK_UPDATE_FLAGS_SECONDARY_PARENT)) {
      _store_address("SEC_PARENT", SL_WISUN_IP_ADDRESS_TYPE_SECONDARY_PARENT, &_current_addr.secondary_parent);
      ip_str = app_wisun_trace_util_get_ip_str(&_current_addr.secondary_parent);
      printf("[%s Network update: Secondary Parent %s]\n", time_str, ip_str);
    }
  }

  app_wisun_trace_util_destroy_ip_str(ip_str);
  app_wisun_trace_util_destroy_time_str(time_str);
  __CHECK_FOR_STATUS(evt->evt.error.status);
}

/* Connected event handler */
void sl_wisun_connected_event_hnd(sl_wisun_evt_t *evt)
{
  uint64_t time_ms = 0;

  if (evt->evt.connected.status != SL_STATUS_OK) {
    printf("[Connection failed. Status: %lu]\n", evt->evt.connected.status);
    _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_NETWORK_DISCONNECTED);
    _app_wisun_core_clear_state(SL_WISUN_APP_CORE_STATE_NETWORK_CONNECTED);
    return;
  }
  // store the current addresses
  _store_current_addresses();

  // update internal time stat
  sl_sleeptimer_tick64_to_ms(sl_sleeptimer_get_tick_count64(), &time_ms);
  _time_stat.tot_disconnected_ms += (time_ms  - _time_stat.connected_ms);
  _time_stat.curr_ms = time_ms;
  _time_stat.connected_ms = time_ms;
  ++_time_stat.conn_cnt;

  time_ms = time_ms - _time_stat.disconnected_ms;

  printf("[%lu s]\n", (uint32_t)time_ms / 1000U);
  _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_NETWORK_CONNECTED);
  _app_wisun_core_clear_state(SL_WISUN_APP_CORE_STATE_NETWORK_DISCONNECTED);
  __CHECK_FOR_STATUS(evt->evt.error.status);
}

/* Socket disconnected event handler */
void sl_wisun_disconnected_event_hnd(sl_wisun_evt_t *evt)
{
  uint64_t time_ms = 0;

  printf("[Disconnected]\n");

  // update internal time stat
  sl_sleeptimer_tick64_to_ms(sl_sleeptimer_get_tick_count64(), &time_ms);
  _time_stat.tot_connected_ms += (time_ms  - _time_stat.disconnected_ms);
  _time_stat.curr_ms = time_ms;
  _time_stat.disconnected_ms = time_ms;

