CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/app/wisun/component/app_core/sl_wisun_app_core.c
  __CHECK_FOR_STATUS(evt->evt.error.status);
  _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_NETWORK_DISCONNECTED);
}

/* Socket connection lost event handler*/
void sl_wisun_connection_lost_event_hnd(sl_wisun_evt_t *evt)
{
  sl_status_t stat;

  // connect to network (using the PHY settings)
  stat = sl_wisun_join((const uint8_t *)_setting.network_name, &_setting.phy);

  if (stat == SL_STATUS_OK) {
    printf("[Connection lost, connecting to \"%s\"]\n", _setting.network_name);
  }
  _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_NETWORK_CONNECTION_LOST);
  _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_NETWORK_DISCONNECTED);
  _app_wisun_core_clear_state(SL_WISUN_APP_CORE_STATE_NETWORK_CONNECTED);
  __CHECK_FOR_STATUS(evt->evt.error.status);
}

/* Error event handler */
void sl_wisun_error_event_hnd(sl_wisun_evt_t *evt)
{
  printf("[Wi-SUN network error occured. Status: %lu\n",
         evt->evt.error.status);
}

/* Join state event handler */
void sl_wisun_join_state_event_hnd(sl_wisun_evt_t *evt)
{
  _join_state = (sl_wisun_join_state_t)evt->evt.join_state.join_state;
#if HEARTBEAT_ENABLED
  (void) evt;
#else
  const char *join_state_str = NULL;
  // if heartbeat not enabled, print join state
  join_state_str = app_wisun_trace_util_conn_state_to_str(_join_state);
  if (join_state_str != NULL) {
    printf("[Join state: %s (%lu)]\n", join_state_str, evt->evt.join_state.join_state);
  }
#endif
  __CHECK_FOR_STATUS(evt->evt.error.status);
}

void sl_wisun_lfn_wake_up_hnd(sl_wisun_evt_t *evt)
{
  __CHECK_FOR_STATUS(evt->evt.error.status);
}

void sl_wisun_multicast_reg_finish_hnd(sl_wisun_evt_t *evt)
{
  __CHECK_FOR_STATUS(evt->evt.error.status);
}

/* Wisun app core init */
void sl_wisun_app_core_init(void)
{
  // init wisun network mutex
  _app_core_mtx = osMutexNew(&_app_wisun_mtx_attr);
  assert(_app_core_mtx != NULL);

  _app_core_state = osEventFlagsNew(&_app_wisun_evt_attr);
  assert(_app_core_state != NULL);
}

/* App core get error */
sl_status_t sl_wisun_app_core_get_state(uint32_t * const state)
{
  *state = osEventFlagsGet(_app_core_state);
  // Check error flag
  if (*state & APP_WISUN_EVTFLAG_ERROR_MSK) {
    return SL_STATUS_FAIL;
  }
  return SL_STATUS_OK;
}

sl_status_t sl_wisun_app_core_wait_state(const uint32_t state, const uint32_t timeout)
{
  uint32_t ret = 0UL;
  ret = osEventFlagsWait(_app_core_state, state, osFlagsWaitAll | osFlagsNoClear, timeout);
  return (ret & APP_WISUN_EVTFLAG_ERROR_MSK) ? SL_STATUS_FAIL : SL_STATUS_OK;
}

/*Connecting to the wisun network*/
void sl_wisun_app_core_network_connect(void)
{
  sl_status_t ret = SL_STATUS_FAIL;
  sl_wisun_join_state_t join_state = SL_WISUN_JOIN_STATE_DISCONNECTED;
  uint64_t time_ms = 0ULL;

  _app_wisun_mutex_acquire(); // get mutex

#if defined(SL_CATALOG_WISUN_APP_SETTING_PRESENT)
  // Init app PHY config
  ret = app_wisun_setting_init_phy_cfg();

  // get full settings (PHY, network name, network size and TX power)
  ret = app_wisun_setting_get(&_setting);
  if (ret != SL_STATUS_OK) {
    printf("[Failed: unable to get settings\n");
    _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_SETTING_ERROR);
    _return_and_mtx_release();
  }
#else
  memcpy(&_setting, &_app_default_settings, sizeof(app_setting_wisun_t));
#endif

  // check join state before connection progress.
  ret = sl_wisun_get_join_state(&join_state);
  __CHECK_FOR_STATUS(ret);
  if (join_state != SL_WISUN_JOIN_STATE_DISCONNECTED) {
    printf("[Failed: already connecting or connected]\n");
    _return_and_mtx_release();
  }

  // application settings
  ret = _app_wisun_application_setting(&_setting);
  if (ret != SL_STATUS_OK) {
    _return_and_mtx_release();
  }

  // security settings
  ret = _app_wisun_security_setting();
  if (ret != SL_STATUS_OK) {
    _return_and_mtx_release();
  }

#if (SL_WISUN_APP_CORE_REGULATION != SL_WISUN_APP_CORE_REGULATION_NONE)
  ret = _app_wisun_regulation_setting();
  if (ret != SL_STATUS_OK) {
    _return_and_mtx_release();
  }
#endif

  ret = sl_wisun_join((const uint8_t *)_setting.network_name, &_setting.phy);

  if (ret == SL_STATUS_OK) {
    // update internal time stat
    sl_sleeptimer_tick64_to_ms(sl_sleeptimer_get_tick_count64(), &time_ms);
    _time_stat.curr_ms = time_ms;
    _time_stat.connected_ms = time_ms;
    _time_stat.disconnected_ms = time_ms;

    printf("\n[Connecting to \"%s\"]\n", _setting.network_name);
  } else {
    _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_CONNECTION_ERROR);
    printf("\n[Connection failed: %lu]\n", ret);
  }
  _app_wisun_mutex_release();
}

void sl_wisun_regulation_tx_level_hnd(sl_wisun_evt_t *evt)
{
  (void)*evt;
}

void sl_wisun_app_core_get_current_addresses(sl_wisun_app_core_current_addr_t * const dest_addresses)
{
  _app_wisun_mutex_acquire();
  memcpy(&dest_addresses->global, &_current_addr.global, sizeof(in6_addr_t));
  memcpy(&dest_addresses->border_router, &_current_addr.border_router, sizeof(in6_addr_t));
  memcpy(&dest_addresses->link_local, &_current_addr.link_local, sizeof(in6_addr_t));
  memcpy(&dest_addresses->primary_parent, &_current_addr.primary_parent, sizeof(in6_addr_t));
  memcpy(&dest_addresses->secondary_parent, &_current_addr.secondary_parent, sizeof(in6_addr_t));
  _app_wisun_mutex_release();
}

void sl_wisun_app_core_set_regulation_active(bool enabled)
{
  _app_wisun_mutex_acquire();
  _regional_regulation_active = enabled;
  _app_wisun_mutex_release();
}

bool sl_wisun_app_core_get_regulation_active(void)
{
  bool retval;
  _app_wisun_mutex_acquire();
  retval = _regional_regulation_active;
  _app_wisun_mutex_release();
  return retval;
}

void sl_wisun_app_core_set_regulation_thresholds(const int8_t warning_level, const  int8_t alert_level)
{
  _app_wisun_mutex_acquire();
  _tresholds.warning_threshold = warning_level;
  _tresholds.alert_threshold = alert_level;
  _app_wisun_mutex_release();
}

sl_status_t sl_wisun_app_core_get_regulation_thresholds(sl_wisun_app_core_reg_thresholds_t* thresholds_out)
{
  if (thresholds_out == NULL) {
    return SL_STATUS_FAIL;
  }

