CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/app/wisun/component/app_core/sl_wisun_app_core.c
  _app_wisun_mutex_acquire();
  thresholds_out->warning_threshold = _tresholds.warning_threshold;
  thresholds_out->alert_threshold = _tresholds.alert_threshold;
  _app_wisun_mutex_release();
  return SL_STATUS_OK;
}

sl_status_t sl_wisun_app_core_get_remaining_tx_budget(uint32_t* const budget_out)
{
  sl_wisun_statistics_t stat;
  sl_status_t ret = SL_STATUS_FAIL;

  if (!_regional_regulation_active || budget_out == NULL) {
    return ret;
  }

  _app_wisun_mutex_acquire();

  if (sl_wisun_get_statistics(SL_WISUN_STATISTICS_TYPE_REGULATION, &stat) == SL_STATUS_OK) {
    // return a meaningful value (budget remaning) or zero (exceeded)
    *budget_out = (stat.regulation.arib.tx_duration_ms < SL_WISUN_APP_CORE_TX_BUDGET)
                  ? (SL_WISUN_APP_CORE_TX_BUDGET - stat.regulation.arib.tx_duration_ms) : 0UL;
    ret = SL_STATUS_OK;
  } else {
    ret = SL_STATUS_FAIL;
  }
  _app_wisun_mutex_release();

  return ret;
}

sl_wisun_join_state_t sl_wisun_app_core_get_join_state(void)
{
  sl_wisun_join_state_t join_state = SL_WISUN_JOIN_STATE_DISCONNECTED;
  _app_wisun_mutex_acquire();
  join_state = _join_state;
  _app_wisun_mutex_release();
  return join_state;
}

void sl_wisun_app_core_get_time_stat(sl_wisun_app_core_time_stat_t * const tstat)
{
  uint64_t time_ms = 0ULL;

  _app_wisun_mutex_acquire();

  // update current time
  sl_sleeptimer_tick64_to_ms(sl_sleeptimer_get_tick_count64(), &time_ms);

  memcpy(tstat, &_time_stat, sizeof(sl_wisun_app_core_time_stat_t));

  // add diff beetween current time and last update time to the actual state
  tstat->curr_ms = time_ms;
  time_ms = tstat->curr_ms - _time_stat.curr_ms;
  if (_join_state != SL_WISUN_JOIN_STATE_OPERATIONAL) {
    tstat->tot_disconnected_ms += time_ms;
  } else {
    tstat->tot_connected_ms += time_ms;
  }

  _app_wisun_mutex_release();
}
#if defined(SL_CATALOG_WISUN_LFN_DEVICE_SUPPORT_PRESENT)

sl_wisun_device_type_t sl_wisun_app_core_get_device_type(void)
{
  return (sl_wisun_device_type_t)_setting.device_type;
}

sl_wisun_lfn_profile_t sl_wisun_app_core_get_lfn_profile(void)
{
  return (sl_wisun_lfn_profile_t)_setting.lfn_profile;
}

const sl_wisun_lfn_params_t *sl_wisun_app_core_get_lfn_params(void)
{
  // Not lfn device
  if (_setting.device_type != SL_WISUN_LFN) {
    return NULL;
  }

  switch (_setting.lfn_profile) {
    case SL_WISUN_LFN_PROFILE_TEST:
      return &SL_WISUN_PARAMS_LFN_TEST;
    case SL_WISUN_LFN_PROFILE_BALANCED:
      return &SL_WISUN_PARAMS_LFN_BALANCED;
    case SL_WISUN_LFN_PROFILE_ECO:
      return &SL_WISUN_PARAMS_LFN_ECO;
    default:
      return NULL;
  }
}
#endif

// -----------------------------------------------------------------------------
//                          Static Function Definitions
// -----------------------------------------------------------------------------

static sl_status_t _app_wisun_application_setting(const app_setting_wisun_t * const setting)
{
  sl_status_t ret = SL_STATUS_FAIL;
  const sl_wisun_connection_params_t *conn_param = NULL;
#if defined(WISUN_CONFIG_BROADCAST_RETRIES)
  sl_wisun_connection_params_t update_param = { 0 };
#endif

  conn_param = sl_wisun_get_conn_param_by_nw_size((sl_wisun_network_size_t) setting->network_size);

  ret = sl_wisun_set_device_type((sl_wisun_device_type_t)setting->device_type);
  if (ret != SL_STATUS_OK) {
    printf("[Failed: unable to set device type: %lu]\n", ret);
    return ret;
  }
#if defined(SL_CATALOG_WISUN_LFN_DEVICE_SUPPORT_PRESENT)
  if (setting->device_type == SL_WISUN_LFN) {
    // Store LFN profile based on wisun config
    ret = sl_wisun_set_lfn_parameters(sl_wisun_app_core_get_lfn_params());
    if (ret != SL_STATUS_OK) {
      printf("[Failed: unable to set device type: %lu]\n", ret);
      return ret;
    }
  }
#endif

#if defined(WISUN_CONFIG_BROADCAST_RETRIES)
  memcpy(&update_param, conn_param, sizeof(sl_wisun_connection_params_t));
  update_param.mpl.trickle_expirations = WISUN_CONFIG_BROADCAST_RETRIES;
  conn_param = &update_param;
#endif

#if defined(SL_CATALOG_WISUN_FFN_DEVICE_SUPPORT_PRESENT)
  // sets the network name
  ret = sl_wisun_set_connection_parameters(conn_param);
  if (ret != SL_STATUS_OK) {
    printf("[Failed: unable to set network size: %lu]\n", ret);
    _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_SET_NETWORK_SIZE_ERROR);
    return ret;
  }
#endif

  // sets the TX power
  ret = sl_wisun_set_tx_power(setting->tx_power);
  if (ret != SL_STATUS_OK) {
    printf("[Failed: unable to set TX power: %lu]\n", ret);
    _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_SET_TX_POWER_ERROR);
    return ret;
  }
#if defined(WISUN_CONFIG_ALLOWED_CHANNELS)
  ret = sl_wisun_set_channel_mask(&wisun_config_allowed_channels_mask);
  if (ret != SL_STATUS_OK) {
    printf("[Failed: unable to set allowed channels: %lu]\n", ret);
    return ret;
  }
#endif
#if defined(WISUN_CONFIG_MODE_SWITCH_PHYS_NUMBER)
  ret = sl_wisun_set_pom_ie(WISUN_CONFIG_MODE_SWITCH_PHYS_NUMBER,
                            (uint8_t *)wisun_config_ms_phys,
                            APP_WISUN_MDR_COMMAND_CAPABILITY);
  if (ret != SL_STATUS_OK) {
    printf("[Failed: unable to set mode switch phys: %lu]\n", ret);
    return ret;
  }
#endif

#if defined(WISUN_CONFIG_DWELL_INTERVAL) && defined(SL_CATALOG_WISUN_FFN_DEVICE_SUPPORT_PRESENT)
  // sets unicast
  ret = sl_wisun_set_unicast_settings(WISUN_CONFIG_DWELL_INTERVAL);

  if (ret != SL_STATUS_OK) {
    printf("[Failed: unable to set dwell interval: %lu]\n", ret);
    _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_SET_DWELL_INTERVAL_ERROR);
    return ret;
  }
#endif

#if defined(WISUN_CONFIG_MAC_ADDRESS_PRESENT)
  // set mac address
  ret = sl_wisun_set_mac_address(&wisun_config_mac_address);
  if (ret != SL_STATUS_OK) {
    printf("[Failed: unable to set MAC address: %lu]\n", ret);
    _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_SET_MAC_ADDR_ERROR);
    return ret;
  }
#endif

#if defined(WISUN_CONFIG_MAC_ALLOW_LIST_PRESENT)
  // set allow mac addresses
  for (uint8_t index = 0U; index < wisun_config_mac_allow_list.mac_list_num; index++) {
    ret = sl_wisun_allow_mac_address(&wisun_config_mac_allow_list.mac_list[index]);
    if (ret != SL_STATUS_OK) {
      printf("[Failed: unable to set allow address: %lu]\n", ret);
      _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_SET_ALLOW_MAC_ADDR_ERROR);
      return ret;
    }
  }
#endif
#if defined(WISUN_CONFIG_MAC_DENY_LIST_PRESENT)
  // set deny mac addresses
  for (uint8_t index = 0U; index < wisun_config_mac_deny_list.mac_list_num; index++) {
    ret = sl_wisun_deny_mac_address(&wisun_config_mac_deny_list.mac_list[index]);
    if (ret != SL_STATUS_OK) {
      printf("[Failed: unable to set allow address: %lu]\n", ret);
      _app_wisun_core_set_state(SL_WISUN_APP_CORE_SET_DENY_MAC_ADDR_ERROR);
      return ret;
    }
  }
#endif

  return ret;
}

sl_status_t _app_wisun_security_setting(void)
{
  sl_status_t ret = SL_STATUS_FAIL;
  const uint32_t max_cert_str_len = 2048U;

