CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/app/wisun/component/app_core/sl_wisun_app_core.c
  // sets the trusted certificate
  ret = sl_wisun_set_trusted_certificate(SL_WISUN_CERTIFICATE_OPTION_IS_REF,
                                         _get_cert_str_len(wisun_config_ca_certificate, max_cert_str_len) + 1,
                                         wisun_config_ca_certificate);
  if (ret != SL_STATUS_OK) {
    printf("[Failed: unable to set the trusted certificate: %lu]\n", ret);
    _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_SET_TRUSTED_CERTIFICATE_ERROR);
    return ret;
  }

  // sets the device certificate
  ret = sl_wisun_set_device_certificate(SL_WISUN_CERTIFICATE_OPTION_IS_REF | SL_WISUN_CERTIFICATE_OPTION_HAS_KEY,
                                        _get_cert_str_len(wisun_config_device_certificate, max_cert_str_len) + 1,
                                        wisun_config_device_certificate);
  if (ret != SL_STATUS_OK) {
    printf("[Failed: unable to set the device certificate: %lu]\n", ret);
    _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_SET_DEVICE_CERTIFICATE_ERROR);
    return ret;
  }

  // sets the device private key
  // NOTE: to use a wrapped PSA private key, the app needs to import the key
  // and use the API sl_wisun_set_device_private_key_id() instead of the one below
  ret = sl_wisun_set_device_private_key(SL_WISUN_PRIVATE_KEY_OPTION_IS_REF,
                                        _get_cert_str_len(wisun_config_device_private_key, max_cert_str_len) + 1,
                                        wisun_config_device_private_key);
  if (ret != SL_STATUS_OK) {
    printf("[Failed: unable to set the device private key: %lu]\n", ret);
    _app_wisun_core_set_state(SL_WISUN_APP_CORE_STATE_SET_DEVICE_PRIVATE_KEY_ERROR);
    return ret;
  }

  return ret;
}

#if (SL_WISUN_APP_CORE_REGULATION != SL_WISUN_APP_CORE_REGULATION_NONE)
__STATIC_INLINE sl_status_t _app_wisun_regulation_setting(void)
{
  sl_status_t ret = SL_STATUS_FAIL;

  // regulation thresholds
  sl_wisun_app_core_reg_thresholds_t thresholds;
  // name of the regulation type to print upon connection
  char* regulation_name;

  (void)sl_wisun_app_core_get_regulation_thresholds(&thresholds);
  ret = sl_wisun_set_regulation_tx_thresholds(thresholds.warning_threshold,
                                              thresholds.alert_threshold);
  if (ret == SL_STATUS_OK) {
    ret = sl_wisun_set_regulation(SL_WISUN_APP_CORE_REGULATION);
    if (ret != SL_STATUS_OK) {
      printf("[Failed: unable to set regulation: %lu]\n", ret);
    } else {
      switch (SL_WISUN_APP_CORE_REGULATION) {
        case SL_WISUN_REGULATION_ARIB:
          regulation_name = "ARIB";
          break;
        case SL_WISUN_REGULATION_WPC:
          regulation_name = "WPC";
          break;
        default:
          regulation_name = "UNKNOWN";
          break;
      }
      printf("\n[Regional regulation set to %s]\n", regulation_name);
      _regional_regulation_active = true;
    }
  } else {
    printf("\n[Failed: unable to set regulation TX thresholds]\n");
  }

  return ret;
}
#endif

/* Mutex acquire */
__STATIC_INLINE void _app_wisun_mutex_acquire(void)
{
  assert(osMutexAcquire(_app_core_mtx, osWaitForever) == osOK);
}

/* Mutex release */
__STATIC_INLINE void _app_wisun_mutex_release(void)
{
  assert(osMutexRelease(_app_core_mtx) == osOK);
}

/* Storing address */
static void _store_address(const char *addr_name,
                           const sl_wisun_ip_address_type_t addr_type,
                           in6_addr_t *addr)
{
  sl_status_t stat = SL_STATUS_FAIL;
  const char *ip_str = NULL;

#if defined(SL_CATALOG_WISUN_LFN_DEVICE_SUPPORT_PRESENT)
  // skip BR address failure for LFN node
  if (addr_type == SL_WISUN_IP_ADDRESS_TYPE_BORDER_ROUTER
      && _setting.device_type == SL_WISUN_LFN) {
    return;
  }
#endif
  stat = sl_wisun_get_ip_address(addr_type, addr);

  ip_str = app_wisun_trace_util_get_ip_str(addr);
  if (addr_type != SL_WISUN_IP_ADDRESS_TYPE_PRIMARY_PARENT
      && addr_type != SL_WISUN_IP_ADDRESS_TYPE_SECONDARY_PARENT) {
    if (stat != SL_STATUS_OK) {
      printf("[Getting '%s' address failed!]\n", addr_name);
    } else {
      printf("[%-14s: %s]\n", addr_name, ip_str);
    }
  }
  app_wisun_trace_util_destroy_ip_str(ip_str);
}

/* Setting error */
__STATIC_INLINE void _app_wisun_core_set_state(const sl_wisun_app_core_state_t flag)
{
  (void) osEventFlagsSet(_app_core_state, 1UL << flag);
}

__STATIC_INLINE void _app_wisun_core_clear_state(const sl_wisun_app_core_state_t flag)
{
  (void) osEventFlagsClear(_app_core_state, 1UL << flag);
}

/* Storing current addresses */
static void _store_current_addresses(void)
{
  memset(&_current_addr, 0, sizeof(sl_wisun_app_core_current_addr_t));
  printf("\nAddresses:\n");
  _store_address("GLOBAL", SL_WISUN_IP_ADDRESS_TYPE_GLOBAL, &_current_addr.global);
  _store_address("LINK_LOCAL", SL_WISUN_IP_ADDRESS_TYPE_LINK_LOCAL, &_current_addr.link_local);
  _store_address("BORDER_ROUTER", SL_WISUN_IP_ADDRESS_TYPE_BORDER_ROUTER, &_current_addr.border_router);
  _store_address("PRIMARY_PARENT", SL_WISUN_IP_ADDRESS_TYPE_PRIMARY_PARENT, &_current_addr.primary_parent);
  _store_address("SECONDARY_PARENT", SL_WISUN_IP_ADDRESS_TYPE_SECONDARY_PARENT, &_current_addr.secondary_parent);
}

/* Get certificate length */
static uint16_t _get_cert_str_len(const uint8_t *cert, const uint16_t max_cert_len)
{
  uint16_t n = 0;
  if (cert == NULL) {
    return 0U;
  }
  for (n = 0; n < max_cert_len && *cert; n++, cert++) {
    ;
  }
  return n;
}
